# Pandas (2|3)

In [2]:
import pandas as pd
import numpy as np  # We will use numpy to create missing values

## Read from multiple input types

In the previous chapter, we took a look into the `read_csv` function to read comma delimited files into pandas dataframes. Here are some examples on how to import the most common data types

__From `.csv`__

In [3]:
df = pd.read_csv("data/mall-data.csv")
df.shape

(200, 6)

__From `.txt`__

In [4]:
df = pd.read_csv("data/mall-data.txt")
df.shape

(200, 6)

__From `.xlsx`__

In [5]:
df = pd.read_excel("data/mall-data.xlsx")
df.shape

(200, 6)

__From `.json`__

In [6]:
df = pd.read_json("data/mall-data.json")
df.shape

(200, 6)

## Computing descriptive statistics

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame

In [7]:
df = pd.DataFrame({
    "k1": [1.4, 5.3, 7.0, 8.3, 12, 5.2, 1.1, 2.0],
    "k2": [500.0, 325.5, 400.0, 123.0, 600.0, 550.0, 432.7, 200.5],
    "k3": [ 6, 26, 14, 39, 43, 17, 48,  8],
})
df.head()

     k1     k2  k3
0   1.4  500.0   6
1   5.3  325.5  26
2   7.0  400.0  14
3   8.3  123.0  39
4  12.0  600.0  43

Total number of records in a dataframe

In [8]:
len(df)  # or df.shape[0]

8

`describe()` shows a quick statistic summary of your data

In [9]:
df.describe()

              k1          k2         k3
count   8.000000    8.000000   8.000000
mean    5.287500  391.462500  25.125000
std     3.789624  166.932698  16.409383
min     1.100000  123.000000   6.000000
25%     1.850000  294.250000  12.500000
50%     5.250000  416.350000  21.500000
75%     7.325000  512.500000  40.000000
max    12.000000  600.000000  48.000000

Calling DataFrame’s `sum` method returns a Series containing column sums

In [10]:
df.sum()

k1      42.3
k2    3131.7
k3     201.0
dtype: float64

Passing `axis='columns'` or `axis=1` sums across the columns instead

In [11]:
df.sum(axis=1)

0    507.4
1    356.8
2    421.0
3    170.3
4    655.0
5    572.2
6    481.8
7    210.5
dtype: float64

You can also call these methods on specific columns

In [12]:
print(df["k1"].sum())
print(df["k2"].sum())
print(df["k3"].sum())

42.3
3131.7
201

Here are some of the most common reduction methods:

Min

In [13]:
df.min()

k1      1.1
k2    123.0
k3      6.0
dtype: float64

Max

In [14]:
df.max()

k1     12.0
k2    600.0
k3     48.0
dtype: float64

Mean

In [15]:
df.mean()

k1      5.2875
k2    391.4625
k3     25.1250
dtype: float64

Median

In [16]:
df.median()

k1      5.25
k2    416.35
k3     21.50
dtype: float64

Standard-deviation

In [17]:
df.std()

k1      3.789624
k2    166.932698
k3     16.409383
dtype: float64

Variance

In [18]:
df.var()

k1       14.361250
k2    27866.525536
k3      269.267857
dtype: float64

Percentiles/Quantiles

In [19]:
df.quantile(0.25)

# df.quantile(0.5) # == df.median()
# df.quantile(0.75)

k1      1.85
k2    294.25
k3     12.50
Name: 0.25, dtype: float64

Covariance

In [20]:
df.cov()

           k1            k2          k3
k1  14.361250     89.165179   25.473214
k2  89.165179  27866.525536   99.948214
k3  25.473214     99.948214  269.267857

Correlation

In [21]:
df.corr()

          k1        k2        k3
k1  1.000000  0.140948  0.409633
k2  0.140948  1.000000  0.036487
k3  0.409633  0.036487  1.000000

In [22]:
df = pd.DataFrame({
    "k1": ["A", "A", "A", "A", "B", "B", "C"],
})
df.head()

  k1
0  A
1  A
2  A
3  A
4  B

Mode

In [23]:
df.mode()

  k1
0  A

Frequency of each value

In [24]:
df["k1"].value_counts()

A    4
B    2
C    1
Name: k1, dtype: int64

## Data cleaning and preparation

### Adding and removing columns

In [25]:
df = pd.DataFrame({
    "x": [10, 20, 30, 20, 10], 
    "y": [5, 4, 3, 2, 1]
    })
df

    x  y
0  10  5
1  20  4
2  30  3
3  20  2
4  10  1

You can create new coluns by selecting it as you would with an existing column: `df["<new column>"] = ...`
All the mathematical operations that you can perform with scalar values/variables can also be done with pandas columns

In [26]:
df["z"] = df["x"] + df["y"]
df

    x  y   z
0  10  5  15
1  20  4  24
2  30  3  33
3  20  2  22
4  10  1  11

In [27]:
df["z"] = df["x"] - df["y"]
df

    x  y   z
0  10  5   5
1  20  4  16
2  30  3  27
3  20  2  18
4  10  1   9

In [28]:
df["z"] = df["x"] * df["y"]
df

    x  y   z
0  10  5  50
1  20  4  80
2  30  3  90
3  20  2  40
4  10  1  10

In [29]:
df["z"] = df["x"] / df["y"]
df

    x  y     z
0  10  5   2.0
1  20  4   5.0
2  30  3  10.0
3  20  2  10.0
4  10  1  10.0

In [30]:
df["z"] = df["x"] ** df["y"]
df

    x  y       z
0  10  5  100000
1  20  4  160000
2  30  3   27000
3  20  2     400
4  10  1      10

To drop existing features, you can use the keyword `.drop()` and inside, specify a list of columns to drop

In [31]:
df.drop(columns=["x"])

   y       z
0  5  100000
1  4  160000
2  3   27000
3  2     400
4  1      10

In [32]:
df.drop(columns=["x", "y"])

        z
0  100000
1  160000
2   27000
3     400
4      10

### Missing Data

Missing data occurs commonly in many data analysis applications. One of the goals of pandas is to make working with missing data as painless as possible. For example, all of the descriptive statistics on pandas objects exclude missing data by default.
The way that missing data is represented in pandas objects is somewhat imperfect, but it is functional for a lot of users. For numeric data, pandas uses the floating-point value NaN (Not a Number) to represent missing data. We call this a sentinel value that can be easily detected:

In [33]:
df = pd.DataFrame(
    data=[(5, 123), (np.nan, 500), (3, 200), (1, np.nan), (2, np.nan)],
    columns=["k1", "k2"]
)
df

    k1     k2
0  5.0  123.0
1  NaN  500.0
2  3.0  200.0
3  1.0    NaN
4  2.0    NaN

Notice isna() returns the same DataFrame, where each cell is either `True` or `False` depending on that cell's null status

In [34]:
df.isna()

      k1     k2
0  False  False
1   True  False
2  False  False
3  False   True
4  False   True

If you apply a `.sum()`, it will summarize the absolute frequency of missing values per feature

In [35]:
df.isna().sum()

k1    1
k2    2
dtype: int64

You can also divide the result by the total number of records, resulting in the relative frequency of nulls. In this example, column `k1` has 20% missing values, and `k2` 40%:

In [36]:
df.isna().sum()/len(df)

k1    0.2
k2    0.4
dtype: float64

You may want to drop rows or columns that are all NA or only those containing any NAs. `dropna` by default drops any row containing a missing value:

In [37]:
df.dropna()

    k1     k2
0  5.0  123.0
2  3.0  200.0

You can specify which columns you want to consider when filtering out nulls

In [38]:
df.dropna(subset=["k1"])

    k1     k2
0  5.0  123.0
2  3.0  200.0
3  1.0    NaN
4  2.0    NaN

Rather than filtering out missing data (and potentially discarding other data along with it), you may want to fill in the “holes” in any number of ways. For most purposes, the fillna method is the workhorse function to use. Calling `fillna` with a constant replaces missing values with that value:

In [39]:
df.fillna(0)

    k1     k2
0  5.0  123.0
1  0.0  500.0
2  3.0  200.0
3  1.0    0.0
4  2.0    0.0

In [40]:
df.fillna(-99)

     k1     k2
0   5.0  123.0
1 -99.0  500.0
2   3.0  200.0
3   1.0  -99.0
4   2.0  -99.0

alling fillna with a dict, you can use a different fill value for each column:

In [41]:
df.fillna({"k1": 0, "k2": -99})

    k1     k2
0  5.0  123.0
1  0.0  500.0
2  3.0  200.0
3  1.0  -99.0
4  2.0  -99.0

You can use statistics to fill missing values, for example, the mean of each column

In [42]:
df.fillna(df.mean())

     k1          k2
0  5.00  123.000000
1  2.75  500.000000
2  3.00  200.000000
3  1.00  274.333333
4  2.00  274.333333

__NOTE:__ So far, the transformations only printed the output to the console. If you want them to happen, either overwrite the dataset/create a new one, e.g. `df = df.dropna()`, or add the keyword `inplace`, e.g. `df.dropna(inplace=True)`

### Rename columns

In [43]:
df = pd.DataFrame(
    data=[(0, 0), (1, 2.205), (2, 4.409), (3, 6.614), (4, 8.818)],
    columns=["Kilograms (Kg)", "Pounts (lbs)"]
)
df

   Kilograms (Kg)  Pounts (lbs)
0               0         0.000
1               1         2.205
2               2         4.409
3               3         6.614
4               4         8.818

Rename can be used in conjunction with a dict-like object providing new values for a subset of the axis labels:

In [44]:
df.rename(columns={"Kilograms (Kg)": "kg", "Pounts (lbs)": "lbs"})

   kg    lbs
0   0  0.000
1   1  2.205
2   2  4.409
3   3  6.614
4   4  8.818

### Replace values

In [45]:
df = pd.DataFrame(data=[("PT"), ("UK"), ("ES"), ("FR"), ("DE")], columns=["country"])
df

  country
0      PT
1      UK
2      ES
3      FR
4      DE

You can replace specific values with some substitutes. The easiest way is to parse a nested dictionary, where the first key is the column to replace, and the following the values to replace. You can also parse a value (or a list) to replace in the entire dataset

In [46]:
df.replace("PT", "Portugal")

    country
0  Portugal
1        UK
2        ES
3        FR
4        DE

In [47]:
df.replace(["PT", "ES"], "PT AND SPAIN")

        country
0  PT AND SPAIN
1            UK
2  PT AND SPAIN
3            FR
4            DE

In [48]:
df.replace({"country": {"PT": "Portugal", "UK": "United Kingdom", "ES": "Spain", "FR": "France", "DE": "Germany"}})

          country
0        Portugal
1  United Kingdom
2           Spain
3          France
4         Germany

### Cast type

We may have the need to transform a certain data type to another, for example, when reading a csv file, a numeric field can be interpreted as a string

In [49]:
df = pd.DataFrame(
    data=[(2.0, "123.0"), (5.0, "500"), (4.0, "150.5")],
    columns=["k1", "k2"]
)
df

    k1     k2
0  2.0  123.0
1  5.0    500
2  4.0  150.5

Let's imagine we want to parse the first column to integer (due to no decimal values), and the second one to float (currently an object/string)

In [50]:
df.dtypes

k1    float64
k2     object
dtype: object

To do so, we use the keyword `.astype(<desired type>)`

In [51]:
df["k1"] = df["k1"].astype(int)
df["k2"] = df["k2"].astype(float)

In [52]:
df.dtypes

k1      int64
k2    float64
dtype: object

### Duplicates

In [53]:
df = pd.DataFrame({
    "k1": ["one", "two"] * 3 + ["two"],
    "k2": [1, 1, 2, 3, 3, 4, 4]}
    )
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not. If a value is duplicated, the row returns `True`, otherwise `False`

In [54]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

By default, the method checks for duplicates in all features, but you can specify a subset of features to detect from:

In [55]:
df.duplicated(subset=["k2"])

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

You can also drop the duplicates you found, either considering all features or a subset of them:

In [56]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [57]:
df.drop_duplicates(subset=["k2"])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

You can also decide on what duplicate values to keep:
- `first`: (Default) Drop duplicates except for the first occurrence.
- `last`: Drop duplicates except for the last occurrence.
- `False`: Drop all duplicates.

In [58]:
df.drop_duplicates(subset=["k2"], keep="first")

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [59]:
df.drop_duplicates(subset=["k2"], keep="last")

    k1  k2
1  two   1
2  one   2
4  one   3
6  two   4

In [60]:
df.drop_duplicates(subset=["k2"], keep=False)

    k1  k2
2  one   2

### Applying functions

It is possible to iterate over a DataFrame or Series as you would with a list, but doing so — especially on large datasets — is very slow.

An efficient alternative is to `apply()` a function to the dataset.

In [61]:
df = pd.DataFrame({"celsius": [-30, -10, 0, 10, 30, 100]})
df

   celsius
0      -30
1      -10
2        0
3       10
4       30
5      100

In this example we are converting celsius degrees to fahrenheit using a loop. <br>
__WARNING: This is highly not recommended. It is only to show how messy and not efficient it is__

In [62]:
# Don't do this
df["fahrenheit"] = 0
for idx, row in enumerate(df.values):
    df.iloc[idx]["fahrenheit"] = row[0] * 1.8 + 32
df

   celsius  fahrenheit
0      -30         -22
1      -10          14
2        0          32
3       10          50
4       30          86
5      100         212

Instead, you can define a clean function and apply it to every row in the dataset

In [63]:
def convert_celsius_to_fahrenheit(c):
    return (c * 1.8) + 32

df["fahrenheit"] = df["celsius"].apply(convert_celsius_to_fahrenheit)
df

   celsius  fahrenheit
0      -30       -22.0
1      -10        14.0
2        0        32.0
3       10        50.0
4       30        86.0
5      100       212.0

Lambda functions also work, if your logic is small enough to fit in one. This way, there's no need to create an actual function

In [64]:
df["fahrenheit"] = df["celsius"].apply(lambda c: (c * 1.8) + 32)
df

   celsius  fahrenheit
0      -30       -22.0
1      -10        14.0
2        0        32.0
3       10        50.0
4       30        86.0
5      100       212.0

__Overall, using apply() will be much faster than iterating manually over rows because pandas is utilizing vectorization.__

## Writing data

If you can read data, naturally, you can write it back. <br>
Usually, after doing extensive data preparation/cleaning, we save the resulting data in order to avoid repeating the whole process again. <br>
similarly to reading, you can save your data in multiple file types.

In [65]:
df = pd.DataFrame({
    "k1": ["one", "two", "three", "four"], 
    "k2": ["dog", "cat", "cat", "dog"]
    })
df

      k1   k2
0    one  dog
1    two  cat
2  three  cat
3   four  dog

Writing this dataset to a new csv file

In [66]:
df.to_csv("my_file.csv")

Reading the data that was written

In [67]:
pd.read_csv("my_file.csv")

   Unnamed: 0     k1   k2
0           0    one  dog
1           1    two  cat
2           2  three  cat
3           3   four  dog

Notice how a new column was created, this is because the index was saved as a new feature. You can avoid this by setting `index=False`

In [68]:
df.to_csv("my_file.csv", index=False)
pd.read_csv("my_file.csv")

      k1   k2
0    one  dog
1    two  cat
2  three  cat
3   four  dog

Using package `os` to delete the file

In [69]:
import os
os.remove("my_file.csv")